In [1]:
import pandas as pd
import numpy as np

obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [2]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [4]:
frame = pd.DataFrame(np.arange(8).reshape(2, 4),
                     index = ['three', 'one'],
                     columns = ['d', 'a', 'b', 'c']
                    )
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [8]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [9]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [13]:
frame.sort_values(by='a',ascending=False)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3